app/views/properties/_latest_properties.html.erb

SELECT "properties".* FROM "properties" ORDER BY "properties"."created_at" DESC
---
	  <% if property.images.first %>
	    <%= image_tag property.images.first, class: "property-image" %><br>