app/controllers/properties_controller.rb

  def create
    @property = Property.new(property_params)
    @property.user_id = current_user.id

    respond_to do |format|
      if @property.save
---
INSERT INTO "properties" ("user_id", "name", "address", "price", "rooms", "bathrooms", "photo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @property.update(property_params)
---
UPDATE "properties" SET "updated_at" = ? WHERE "properties"."id" = ?  [["updated_at", "2023-05-09 08:24:54.284096"], ["id", 2]]

  def destroy
    @property.destroy
---
DELETE FROM "properties" WHERE "properties"."id" = ?  [["id", 1]]

    def set_property
      @property = Property.find(params[:id])
---
SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]